app/controllers/answers_controller.rb

	def create
		@question = Question.find params[:question_id]
		@answer = Answer.new(params[:answer].permit(:answer))
		@answer.question_id = @question.id
		@answer.user = current_user
     	if @answer.save!
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1  ORDER BY "questions"."id" ASC LIMIT 1  [["id", 5]]
INSERT INTO "answers" ("answer", "correct", "created_at", "question_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["answer", "t"], ["correct", "f"], ["created_at", "2014-01-23 12:54:09.589467"], ["question_id", 5], ["updated_at", "2014-01-23 12:54:09.589467"], ["user_id", 9]]