app/controllers/questions_controller.rb

INSERT INTO "questions" ("correct_answer", "created_at", "description", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["correct_answer", "f"], ["created_at", "2014-01-22 15:37:20.038183"], ["description", "Does sun shines during night time?"], ["updated_at", "2014-01-22 15:37:20.038183"], ["user_id", 5]]
---
  def create
    @question = Question.new params[:question].permit(:description, :correct_answer)
    @question.user = current_user
    if @question.save

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @question = Question.find params[:id]

SELECT "questions".* FROM "questions"  WHERE (user_id = 3)
---
  def index
    @questions = Question.where("user_id = ?", current_user)

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
    @question = Question.find params[:id]

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "description" = $1, "updated_at" = $2 WHERE "questions"."id" = 1  [["description", "Bannanas red?"], ["updated_at", "2014-01-16 16:39:27.548246"]]
---
  def update
    @question = Question.find params[:id]
    @question.update params[:question].permit(:description, :correct_answer)

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 2]]
---
  def destroy
    @question = Question.find params[:id]
    @question.destroy